## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.keyvault.data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.keyvault.azurerm_key_vault.key_vault will be created
  + resource "azurerm_key_vault" "key_vault" {
      + access_policy                   = (known after apply)
      + enable_rbac_authorization       = true
      + enabled_for_deployment          = false
      + enabled_for_disk_encryption     = true
      + enabled_for_template_deployment = true
      + id                              = (known after apply)
      + location                        = "northeurope"
      + name                            = "kv-aztf-log-prod-ne-03"
      + public_network_access_enabled   = false
      + purge_protection_enabled        = false
      + resource_group_name             = "rg-aztf-logging-prod-ne-02"
      + sku_name                        = "standard"
      + soft_delete_retention_days      = 90
      + tenant_id                       = (known after apply)
      + vault_uri                       = (known after apply)

      + network_acls {
          + bypass         = "AzureServices"
          + default_action = "Deny"
          + ip_rules       = [
              + "84.10.55.110/32",
            ]
        }
    }

  # module.rg.azurerm_resource_group.rg will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "northeurope"
      + name     = "rg-aztf-logging-prod-ne-02"
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
</details>